data/verification/convergence_1x/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
1000
(
(5e-05 5e-05 5e-06)
(0.00015 5e-05 5e-06)
(0.00025 5e-05 5e-06)
(0.00035 5e-05 5e-06)
(0.00045 5e-05 5e-06)
(0.00055 5e-05 5e-06)
(0.00065 5e-05 5e-06)
(0.00075 5e-05 5e-06)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 10((0 5e-05 5e-06) (0 0.00015 5e-06) (0 0.00025 5e-06) (0 0.00035 5e-06) (0 0.00045 5e-06) (0 0.00055 5e-06) (0 0.00065 5e-06) (0 0.00075 5e-06) (0 0.00085 5e-06) (0 0.00095 5e-06));
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 10((0.01 5e-05 5e-06) (0.01 0.00015 5e-06) (0.01 0.00025 5e-06) (0.01 0.00035 5e-06) (0.01 0.00045 5e-06) (0.01 0.00055 5e-06) (0.01 0.00065 5e-06) (0.01 0.00075 5e-06) (0.01 0.00085 5e-06) (0.01 0.00095 5e-06));
    }
    walls
    {
        type            calculated;
        value           nonuniform List<vector> 
200
(
(5e-05 0 5e-06)
(0.00015 0 5e-06)
(0.00025 0 5e-06)
(0.00035 0 5e-06)
(0.00045 0 5e-06)
(0.00055 0 5e-06)
(0.00065 0 5e-06)
(0.00075 0 5e-06)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
