data/verification/convergence_1x/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1000
(
5e-05
5e-05
5e-05
5e-05
5e-05
5e-05
5e-05
5e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 10(5e-05 0.00015 0.00025 0.00035 0.00045 0.00055 0.00065 0.00075 0.00085 0.00095);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 10(5e-05 0.00015 0.00025 0.00035 0.00045 0.00055 0.00065 0.00075 0.00085 0.00095);
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0
0
0
0
0
0
0
0
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
